# üåê NAT & PAT (Network Address Translation)

<div align="center">

![NAT Banner](images/nat-banner.png)

**Complete Guide to IP Address Translation and Internet Connectivity**

[![Packet Tracer](https://img.shields.io/badge/Packet_Tracer-Lab_Tested-blue?style=for-the-badge&logo=cisco)](.)
[![Types](https://img.shields.io/badge/Types-3_Covered-green?style=for-the-badge)](.)
[![Status](https://img.shields.io/badge/Status-Complete-success?style=for-the-badge)](.)

[üìñ Overview](#-overview) ‚Ä¢ [üéØ Concept](#-concept) ‚Ä¢ [üîß Static NAT](#-static-nat) ‚Ä¢ [‚ö° Dynamic NAT](#-dynamic-nat) ‚Ä¢ [üöÄ PAT](#-pat-port-address-translation)

</div>

---

## üìñ Overview

**NAT (Network Address Translation)** is a networking technique that translates IP addresses, enabling private networks to communicate with the internet.

### Key Features:

| Feature | Details |
|---------|---------|
| **Purpose** | Translate private IPs to public IPs |
| **Types** | Static NAT, Dynamic NAT, PAT (Overload) |
| **Main Benefit** | Conserve public IP addresses |
| **Security** | Hides internal network structure |
| **Common Use** | Home routers, office networks |

---

## üìö Table of Contents

- [üéØ Concept](#-concept)
- [üîß Static NAT](#-static-nat)
- [‚ö° Dynamic NAT](#-dynamic-nat)
- [üöÄ PAT (Port Address Translation)](#-pat-port-address-translation)
- [üìä Comparison](#-nat-types-comparison)
- [üìù Quick Reference](#-quick-reference)

---

## üéØ Concept

### Basic Understanding

**The Problem:**

```
Your home devices:
‚îú‚îÄ Phone: 192.168.1.5
‚îú‚îÄ Laptop: 192.168.1.6
‚îú‚îÄ Tablet: 192.168.1.7
‚îî‚îÄ Smart TV: 192.168.1.8

These are PRIVATE IPs - Internet doesn't recognize them! ‚ùå
```

**The Solution - NAT:**

```
NAT Router translates:
Private IP ‚Üí Public IP ‚Üí Internet ‚úì

Device (192.168.1.5) ‚Üí Router (203.0.113.5) ‚Üí Internet
```

---

### Why NAT is Essential

#### 1. IPv4 Address Shortage

```
Problem: Only ~4 billion IPv4 addresses exist
Reality: Billions of devices need internet access

Solution: NAT allows multiple devices to share one public IP!
```

#### 2. Security

```
Private Network:
‚îú‚îÄ Internal IPs hidden from internet
‚îú‚îÄ Direct access from outside blocked
‚îî‚îÄ NAT acts like a firewall

Without NAT: Devices directly exposed ‚ùå
With NAT: Internal structure hidden ‚úì
```

#### 3. Cost Efficiency

```
Without NAT: 100 devices = 100 public IPs needed
With NAT: 100 devices = 1 public IP needed!

Savings: Huge! (Public IPs are expensive)
```

---

### How NAT Works

**Step-by-Step Process:**

```
1. Device sends request:
   Source: 192.168.1.5:50001
   Destination: 8.8.8.8:80 (Google DNS)

2. NAT Router translates:
   Changes source to: 203.0.113.5:50001
   Keeps destination: 8.8.8.8:80

3. Internet sees:
   Request from: 203.0.113.5 (public IP)
   
4. Response comes back:
   To: 203.0.113.5:50001

5. NAT Router translates back:
   Sends to: 192.168.1.5:50001
   
6. Device receives response ‚úì
```

---

### NAT Terminology

<div align="center">

| Term | Meaning | Example |
|------|---------|---------|
| **Inside Local** | Private IP (internal network) | 192.168.1.5 |
| **Inside Global** | Public IP (on internet) | 203.0.113.5 |
| **Outside Local** | Destination as router sees | 8.8.8.8 |
| **Outside Global** | Real destination IP | 8.8.8.8 |

</div>

**Simple Explanation:**
```
Inside = Your network
Outside = Internet
Local = Private address
Global = Public address
```

---

## üîß Static NAT

### Concept

<div align="center">

| Feature | Details |
|---------|---------|
| **Type** | One-to-One mapping |
| **Mapping** | Permanent (fixed) |
| **Public IPs Needed** | Equal to private IPs |
| **Use Case** | Servers requiring permanent access |
| **Example** | Web server, Email server |

</div>

### How It Works

**Static NAT = Fixed Mapping:**

```
Private IP      ‚Üê‚Üí      Public IP
192.168.1.10    ‚Üê‚Üí    203.0.113.10 (Permanent)
192.168.1.11    ‚Üê‚Üí    203.0.113.11 (Permanent)
192.168.1.12    ‚Üê‚Üí    203.0.113.12 (Permanent)

Always same mapping, never changes!
```

**Real-Life Example:**
```
Company web server:
- Internal IP: 192.168.1.10
- Public IP: 203.0.113.10
- Domain: www.company.com ‚Üí 203.0.113.10

Server always needs same public IP!
```

**Disadvantage:**
```
10 devices = 10 public IPs needed
100 devices = 100 public IPs needed

Wasteful and expensive! ‚ùå
```

---

### Lab Implementation - Static NAT

#### üìä Network Topology:

<p align="center">
  <img src="images/static-nat-topology.png" alt="Static NAT Topology" width="550">
</p>

**Network Design:**
```
Private Network (192.168.10.0/24)
        ‚Üì
   [NAT Router]
        ‚Üì
Public Network (200.0.0.0/24)
        ‚Üì
    [Internet]
```

---

### Configuration - NAT Device

<p align="center">
  <img src="images/static-nat-router-config.png" alt="NAT Router Config" width="500">
</p>

**IP Assignment:**

| Interface | IP Address | Type |
|-----------|------------|------|
| **Fa0/0** | 192.168.10.1 | Inside (Private) |
| **Fa0/1** | 200.0.0.1 | Outside (Public) |

```cisco
! NAT Device - Interface Configuration
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# ip nat inside
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastEthernet 0/1
Router(config-if)# ip address 200.0.0.1 255.255.255.0
Router(config-if)# ip nat outside
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

#### OSPF Configuration (NAT Router):

<p align="center">
  <img src="images/static-nat-ospf.png" alt="NAT OSPF" width="600">
</p>

```cisco
! OSPF Configuration
Router(config)# router ospf 1
Router(config-router)# network 192.168.10.0 0.0.0.255 area 0
Router(config-router)# network 200.0.0.0 0.0.0.255 area 0
Router(config-router)# exit
```

---

### Configuration - Router 0

<p align="center">
  <img src="images/static-nat-router0-config.png" alt="Router 0 Config" width="600">
</p>

```cisco
! Router 0 Configuration
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 200.0.0.2 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastEthernet 0/1
Router(config-if)# ip address 210.0.0.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

#### OSPF Configuration (Router 0):

<p align="center">
  <img src="images/static-nat-router0-ospf.png" alt="Router 0 OSPF" width="600">
</p>

```cisco
! OSPF for Router 0
Router(config)# router ospf 1
Router(config-router)# network 200.0.0.0 0.0.0.255 area 0
Router(config-router)# network 210.0.0.0 0.0.0.255 area 0
Router(config-router)# exit
```

---

#### Verification:

<p align="center">
  <img src="images/static-nat-verification.png" alt="Static NAT Verification" width="450">
</p>

```cisco
Router# show ip route
Router# show ip ospf neighbor
```

---

### Static NAT Configuration

<p align="center">
  <img src="images/static-nat-config.png" alt="Static NAT Configuration" width="600">
</p>

```cisco
! Static NAT Configuration on NAT Router
Router(config)# ip nat inside source static 192.168.10.10 200.0.0.10
Router(config)# ip nat inside source static 192.168.10.11 200.0.0.11
Router(config)# ip nat inside source static 192.168.10.12 200.0.0.12
```

**Command Breakdown:**
```
ip nat inside source static [inside-local] [inside-global]
                              ‚Üì               ‚Üì
                         Private IP      Public IP

Example:
ip nat inside source static 192.168.10.10 200.0.0.10
                              ‚Üë                ‚Üë
                        PC's real IP    IP seen on internet
```

---

### Results - Static NAT

<p align="center">
  <img src="images/static-nat-checking.png" alt="Static NAT Checking" width="450">
</p>

**Verification Commands:**
```cisco
Router# show ip nat translations
Router# show ip nat statistics
```

**Translation Table:**
```
Pro Inside global      Inside local       Outside local      Outside global
--- 200.0.0.10         192.168.10.10      ---                ---
--- 200.0.0.11         192.168.10.11      ---                ---
--- 200.0.0.12         192.168.10.12      ---                ---
```

**Result:** ‚úÖ Static NAT configured successfully, permanent mappings created

---

## ‚ö° Dynamic NAT

### Concept

<div align="center">

| Feature | Details |
|---------|---------|
| **Type** | Many-to-Many (Pool-based) |
| **Mapping** | Temporary (dynamic) |
| **Public IPs Needed** | Pool of public IPs |
| **Use Case** | Multiple users, limited public IPs |
| **Limitation** | If pool exhausted, no new connections |

</div>

### How It Works

**Dynamic NAT = Temporary Assignment from Pool:**

```
Public IP Pool: 203.0.113.10 to 203.0.113.20 (11 IPs)

When device needs internet:
‚îú‚îÄ Gets an IP from pool
‚îú‚îÄ Uses it for the session
‚îî‚îÄ Returns to pool when done

First come, first served!
```

**Example:**
```
Time 10:00 AM:
PC1 (192.168.1.5) ‚Üí Gets 203.0.113.10
PC2 (192.168.1.6) ‚Üí Gets 203.0.113.11

Time 10:30 AM (PC1 disconnects):
203.0.113.10 ‚Üí Back to pool (available)

Time 10:45 AM:
PC3 (192.168.1.7) ‚Üí Gets 203.0.113.10 (reused)
```

**Problem:**
```
Pool has 11 IPs
12th user tries to connect ‚Üí BLOCKED! ‚ùå

Pool exhausted = No internet for new users
```

---

### Lab Implementation - Dynamic NAT

#### üìä Network Topology:

<p align="center">
  <img src="images/dynamic-nat-topology.png" alt="Dynamic NAT Topology" width="550">
</p>

---

### Configuration - NAT Device

<p align="center">
  <img src="images/dynamic-nat-router-config.png" alt="Dynamic NAT Router" width="500">
</p>

```cisco
! NAT Device - Interface Configuration
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# ip nat inside
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastEthernet 0/1
Router(config-if)# ip address 200.0.0.1 255.255.255.0
Router(config-if)# ip nat outside
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

#### OSPF Configuration (NAT Router):

<p align="center">
  <img src="images/dynamic-nat-ospf.png" alt="Dynamic NAT OSPF" width="600">
</p>

```cisco
! OSPF for NAT Router
Router(config)# router ospf 1
Router(config-router)# network 192.168.10.0 0.0.0.255 area 0
Router(config-router)# network 200.0.0.0 0.0.0.255 area 0
Router(config-router)# exit
```

---

### Configuration - Router 0

<p align="center">
  <img src="images/dynamic-nat-router0-config.png" alt="Router 0 Config" width="600">
</p>

```cisco
! Router 0 Configuration
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 200.0.0.2 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastEthernet 0/1
Router(config-if)# ip address 210.0.0.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

#### OSPF Configuration (Router 0):

<p align="center">
  <img src="images/dynamic-nat-router0-ospf.png" alt="Router 0 OSPF" width="600">
</p>

```cisco
! OSPF for Router 0
Router(config)# router ospf 1
Router(config-router)# network 200.0.0.0 0.0.0.255 area 0
Router(config-router)# network 210.0.0.0 0.0.0.255 area 0
Router(config-router)# exit
```

---

#### Verification:

<p align="center">
  <img src="images/dynamic-nat-verification.png" alt="Dynamic NAT Verification" width="450">
</p>

---

### Dynamic NAT Configuration

<p align="center">
  <img src="images/dynamic-nat-config.png" alt="Dynamic NAT Configuration" width="550">
</p>

**Step 1: Create Access List (Define which IPs can use NAT):**
```cisco
Router(config)# access-list 1 permit 192.168.10.0 0.0.0.255
```

**Step 2: Create Public IP Pool:**
```cisco
Router(config)# ip nat pool PUBLIC_POOL 200.0.0.10 200.0.0.20 netmask 255.255.255.0
```

**Step 3: Link ACL with Pool:**
```cisco
Router(config)# ip nat inside source list 1 pool PUBLIC_POOL
```

**Step 4: Define Inside/Outside Interfaces (Already done above):**
```cisco
Router(config)# interface fa0/0
Router(config-if)# ip nat inside

Router(config)# interface fa0/1
Router(config-if)# ip nat outside
```

---

### Command Explanation

**1. Access List:**
```cisco
access-list 1 permit 192.168.10.0 0.0.0.255
```
```
Purpose: Define which private IPs can use NAT
0.0.0.255 = Wildcard mask (allows 192.168.10.0 - 192.168.10.255)
```

**2. NAT Pool:**
```cisco
ip nat pool PUBLIC_POOL 200.0.0.10 200.0.0.20 netmask 255.255.255.0
```
```
PUBLIC_POOL = Pool name (any name)
200.0.0.10 to 200.0.0.20 = 11 public IPs available
netmask = Subnet mask for public IPs
```

**3. Link ACL to Pool:**
```cisco
ip nat inside source list 1 pool PUBLIC_POOL
```
```
list 1 = Access list number
pool PUBLIC_POOL = Pool name created above
```

---

### Results - Dynamic NAT

<p align="center">
  <img src="images/dynamic-nat-verifying.png" alt="Dynamic NAT Verifying" width="500">
</p>

**Verification:**
```cisco
Router# show ip nat translations
Router# show ip nat statistics
Router# show access-lists
```

**Result:** ‚úÖ Dynamic NAT working, IPs assigned from pool dynamically

---

## üöÄ PAT (Port Address Translation)

### Concept

<div align="center">

| Feature | Details |
|---------|---------|
| **Type** | Many-to-One (Overload) |
| **Mapping** | Port-based differentiation |
| **Public IPs Needed** | Just 1 (or very few) |
| **Connections** | 65,000+ per public IP |
| **Use Case** | Home routers, offices (MOST COMMON) |

</div>

### How It Works

**PAT = One IP, Different Ports:**

```
Many Private IPs ‚Üí 1 Public IP (using different ports)

192.168.1.2:50001  ‚Üí  203.0.113.5:50001
192.168.1.3:50002  ‚Üí  203.0.113.5:50002
192.168.1.4:50003  ‚Üí  203.0.113.5:50003
192.168.1.5:50004  ‚Üí  203.0.113.5:50004
...up to 65,000+ connections!

All using same public IP: 203.0.113.5
Differentiated by port numbers! ‚úì
```

**Real-Life Example:**
```
Your home WiFi:
- Phone: 192.168.1.5:51000 ‚Üí 203.0.113.5:51000
- Laptop: 192.168.1.6:51001 ‚Üí 203.0.113.5:51001
- Tablet: 192.168.1.7:51002 ‚Üí 203.0.113.5:51002
- Smart TV: 192.168.1.8:51003 ‚Üí 203.0.113.5:51003

All devices share 1 public IP!
Router tracks connections by port numbers.
```

**Why PAT is Best:**
```
‚úÖ Most efficient (1 IP for thousands of devices)
‚úÖ Cost-effective (no need for multiple public IPs)
‚úÖ Scalable (65,000+ simultaneous connections)
‚úÖ Default in home/office routers
```

---

### Lab Implementation - PAT

#### üìä Network Topology:

<p align="center">
  <img src="images/pat-topology.png" alt="PAT Topology" width="550">
</p>

---

### Configuration - PAT Device

<p align="center">
  <img src="images/pat-router-config.png" alt="PAT Router Config" width="600">
</p>

```cisco
! PAT Device - Interface Configuration
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# ip nat inside
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastEthernet 0/1
Router(config-if)# ip address 200.0.0.1 255.255.255.0
Router(config-if)# ip nat outside
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

#### OSPF Configuration (PAT Router):

<p align="center">
  <img src="images/pat-ospf.png" alt="PAT OSPF" width="600">
</p>

```cisco
! OSPF for PAT Router
Router(config)# router ospf 1
Router(config-router)# network 192.168.10.0 0.0.0.255 area 0
Router(config-router)# network 200.0.0.0 0.0.0.255 area 0
Router(config-router)# exit
```

---

### Configuration - Router 0

<p align="center">
  <img src="images/pat-router0-config.png" alt="Router 0 Config" width="600">
</p>

```cisco
! Router 0 Configuration
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 200.0.0.2 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fastEthernet 0/1
Router(config-if)# ip address 210.0.0.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

---

#### OSPF Configuration (Router 0):

<p align="center">
  <img src="images/pat-router0-ospf.png" alt="Router 0 OSPF" width="600">
</p>

```cisco
! OSPF for Router 0
Router(config)# router ospf 1
Router(config-router)# network 200.0.0.0 0.0.0.255 area 0
Router(config-router)# network 210.0.0.0 0.0.0.255 area 0
Router(config-router)# exit
```

---

#### Verification:

<p align="center">
  <img src="images/pat-verification.png" alt="PAT Verification" width="500">
</p>

---

### PAT Configuration

<p align="center">
  <img src="images/pat-config.png" alt="PAT Configuration" width="700">
</p>

**Method 1: PAT with Pool (Less Common):**

```cisco
! Step 1: Create ACL
Router(config)# access-list 1 permit 192.168.10.0 0.0.0.255

! Step 2: Create Pool (even 1 IP)
Router(config)# ip nat pool PAT_POOL 200.0.0.10 200.0.0.10 netmask 255.255.255.0

! Step 3: Link with OVERLOAD keyword
Router(config)# ip nat inside source list 1 pool PAT_POOL overload
```

**Method 2: PAT with Interface (Most Common):**

```cisco
! Step 1: Create ACL
Router(config)# access-list 1 permit 192.168.10.0 0.0.0.255

! Step 2: Use interface IP with OVERLOAD
Router(config)# ip nat inside source list 1 interface fastEthernet 0/1 overload
```

---

### Command Explanation

**Key Difference: OVERLOAD Keyword**

```
Without overload:
ip nat inside source list 1 pool POOL_NAME
‚Üí This is Dynamic NAT (pool-based, limited)

With overload:
ip nat inside source list 1 pool POOL_NAME overload
‚Üí This is PAT (port-based, unlimited*)

OVERLOAD = PAT Magic! ‚ö°
```

**Interface-based PAT (Most Common):**
```cisco
ip nat inside source list 1 interface fa0/1 overload
```
```
list 1 = ACL defining private IPs
interface fa0/1 = Use this interface's public IP
overload = Enable PAT (port translation)

Result: All devices share fa0/1's IP with different ports
```

---

### Results - PAT

<p align="center">
  <img src="images/pat-ping-test.png" alt="PAT Ping Test" width="550">
</p>

**Testing from PC to Server:**
```
PC (192.168.10.10) ‚Üí Server (210.0.0.10)

NAT Translation:
192.168.10.10:50001 ‚Üí 200.0.0.1:50001 ‚Üí 210.0.0.10
```

---

<p align="center">
  <img src="images/pat-verified.png" alt="PAT Verified" width="600">
</p>

**Verification:**
```cisco
Router# show ip nat translations

Pro Inside global      Inside local       Outside local      Outside global
icmp 200.0.0.1:1      192.168.10.10:1    210.0.0.10:1      210.0.0.10:1
icmp 200.0.0.1:2      192.168.10.11:2    210.0.0.10:2      210.0.0.10:2
icmp 200.0.0.1:3      192.168.10.12:3    210.0.0.10:3      210.0.0.10:3
```

**Notice:** Same public IP (200.0.0.1), different ports (1, 2, 3)

**Result:** ‚úÖ PAT successfully configured, all devices sharing one public IP

---

## üìä NAT Types Comparison

### Quick Comparison

<div align="center">

| Feature | Static NAT | Dynamic NAT | PAT (Overload) |
|---------|------------|-------------|----------------|
| **Mapping** | One-to-One | Many-to-Many | Many-to-One |
| **Type** | Permanent | Temporary | Temporary |
| **Public IPs** | Equal to devices | Pool (multiple) | Just 1 (or few) |
| **Use Case** | Servers | Limited users | Home/Office |
| **Scalability** | ‚ùå Poor | ‚ö†Ô∏è Limited | ‚úÖ Excellent |
| **Cost** | ‚ùå Expensive | ‚ö†Ô∏è Moderate | ‚úÖ Cheap |
| **Connections** | 1:1 | Limited by pool | 65,000+ |
| **Command** | `static` | `pool` | `overload` |

</div>

---

### Visual Comparison

**Static NAT:**
```
10 Devices = 10 Public IPs needed
‚îú‚îÄ PC1 (192.168.1.10) ‚Üí 203.0.113.10 (permanent)
‚îú‚îÄ PC2 (192.168.1.11) ‚Üí 203.0.113.11 (permanent)
‚îú‚îÄ PC3 (192.168.1.12) ‚Üí 203.0.113.12 (permanent)
‚îî‚îÄ ... (7 more)

Total: 10 public IPs ‚ùå Wasteful!
```

**Dynamic NAT:**
```
10 Devices, Pool of 5 Public IPs
‚îú‚îÄ First 5 devices get IPs from pool ‚úì
‚îî‚îÄ 6th device ‚Üí BLOCKED! ‚ùå

Pool exhausted = No new connections
```

**PAT (Best Solution):**
```
1000 Devices = 1 Public IP!
‚îú‚îÄ PC1: 203.0.113.5:50001
‚îú‚îÄ PC2: 203.0.113.5:50002
‚îú‚îÄ PC3: 203.0.113.5:50003
‚îî‚îÄ ... (up to 65,000 connections)

Total: 1 public IP ‚úÖ Efficient!
```

---

### When to Use What?

**Use Static NAT:**
```
‚úì Web servers (need permanent public IP)
‚úì Email servers
‚úì FTP servers
‚úì Any service requiring DNS mapping
‚úì External users need consistent access
```

**Use Dynamic NAT:**
```
‚ö†Ô∏è Rarely used nowadays
‚úì Legacy systems
‚úì Specific compliance requirements
‚úì Limited public IPs but not concerned about efficiency
```

**Use PAT (Most Common):**
```
‚úÖ Home networks
‚úÖ Office networks
‚úÖ Any scenario with limited public IPs
‚úÖ Large number of internal devices
‚úÖ Cost-effective solution needed
```

---

## üìù Quick Reference

### Configuration Templates

#### Static NAT:
```cisco
! Define inside/outside
interface fa0/0
 ip nat inside
interface fa0/1
 ip nat outside

! Create static mappings
ip nat inside source static 192.168.1.10 203.0.113.10
ip nat inside source static 192.168.1.11 203.0.113.11
```

#### Dynamic NAT:
```cisco
! Define inside/outside
interface fa0/0
 ip nat inside
interface fa0/1
 ip nat outside

! Create ACL
access-list 1 permit 192.168.1.0 0.0.0.255

! Create pool
ip nat pool POOL_NAME 203.0.113.10 203.0.113.20 netmask 255.255.255.0

! Link ACL to pool
ip nat inside source list 1 pool POOL_NAME
```

#### PAT (Method 1 - Pool):
```cisco
! ACL
access-list 1 permit 192.168.1.0 0.0.0.255

! Pool (can be single IP)
ip nat pool PAT_POOL 203.0.113.5 203.0.113.5 netmask 255.255.255.0

! Link with overload
ip nat inside source list 1 pool PAT_POOL overload
```

#### PAT (Method 2 - Interface, Most Common):
```cisco
! ACL
access-list 1 permit 192.168.1.0 0.0.0.255

! Use interface IP
ip nat inside source list 1 interface fa0/1 overload
```

---

### Verification Commands

```cisco
! View all translations
show ip nat translations

! View NAT statistics
show ip nat statistics

! Clear translations
clear ip nat translation *

! Debug NAT (use carefully)
debug ip nat
debug ip nat detailed
```

---

### Troubleshooting Guide

| Issue | Possible Cause | Solution |
|-------|---------------|----------|
| **NAT not working** | Inside/Outside not set | Check `ip nat inside/outside` on interfaces |
| | ACL blocking traffic | Verify ACL permits correct network |
| | Routing issue | Check routing table |
| **Pool exhausted** | Too many users | Increase pool size or use PAT |
| | Timeout too long | Reduce NAT timeout values |
| **PAT not working** | Missing `overload` | Add `overload` keyword |
| | ACL misconfigured | Verify wildcard mask |

---

### Important Points

**1. Inside vs Outside:**
```
ip nat inside = Private network interface
ip nat outside = Public/Internet interface

MUST configure both!
```

**2. Access List Wildcard Mask:**
```
Subnet Mask: 255.255.255.0
Wildcard Mask: 0.0.0.255

Formula: Wildcard = 255.255.255.255 - Subnet Mask
```

**3. Overload Keyword:**
```
Critical for PAT!
Without overload = Dynamic NAT (limited)
With overload = PAT (unlimited)
```

**4. Port Range:**
```
PAT uses ports: 1024-65535
Each connection gets unique port
Maximum ~65,000 simultaneous connections per IP
```

---

### Best Practices

1. **Use PAT for most scenarios**
   ```
   Most efficient and cost-effective
   ```

2. **Static NAT for servers only**
   ```
   Only when permanent public IP needed
   ```

3. **Always configure inside/outside**
   ```
   NAT won't work without these
   ```

4. **Document your NAT mappings**
   ```
   Track which IPs are used for what
   ```

5. **Use meaningful pool names**
   ```
   POOL_NAME instead of POOL1
   ```

---
---

## üéì What I Learned

‚úÖ **NAT Fundamentals** - IP address translation concepts  
‚úÖ **Static NAT** - One-to-one permanent mapping for servers  
‚úÖ **Dynamic NAT** - Pool-based temporary translation  
‚úÖ **PAT (Overload)** - Port-based translation, most efficient  
‚úÖ **Inside/Outside** - Proper interface designation  
‚úÖ **Access Lists** - Controlling which IPs can use NAT  
‚úÖ **Configuration** - Complete NAT/PAT implementation  
‚úÖ **Integration** - NAT with OSPF routing protocol  
‚úÖ **Troubleshooting** - Common issues and solutions  

---

## üöÄ How to Use This Repository

1. **Clone the repository:**
   ```bash
   git clone https://github.com/your-username/NAT-PAT-Implementation.git
   ```

2. **Study each type:**
   - Understand Static NAT concepts
   - Learn Dynamic NAT pool-based translation
   - Master PAT (most important)

3. **Practice in lab:**
   - Build topologies in Packet Tracer
   - Apply configurations
   - Test connectivity

4. **Real-world application:**
   - Understand home router operation
   - Learn enterprise NAT strategies
   - Practice troubleshooting

---

## üìû Connect With Me

<div align="center">

[![Email](https://img.shields.io/badge/Email-a.wahid7860668%40gmail.com-red?style=for-the-badge&logo=gmail)](mailto:a.wahid7860668@gmail.com)
[![LinkedIn](https://img.shields.io/badge/LinkedIn-Abdul_Wahid-blue?style=for-the-badge&logo=linkedin)](https://www.linkedin.com/in/abdul-wahid022)
[![GitHub](https://img.shields.io/badge/GitHub-abdul--wahid022-black?style=for-the-badge&logo=github)](https://github.com/abdul-wahid022)

**üí¨ Questions? Need Packet Tracer files? Feel free to reach out!**

</div>

---

## üìÑ License

This project is created for **educational purposes** and is open-source.

---

<div align="center">

### ‚≠ê If you found this helpful, please give it a star!

**Made with üíô by ABDUL WAHID**

*Last Updated: January 2026*

</div>
