# üîí Port Security & Unused Ports - Complete Guide

<div align="center">

![Port Security Banner](images/port-security-banner.png)

**MAC Address Filtering and Unused Port Protection**

[![Packet Tracer](https://img.shields.io/badge/Packet_Tracer-Lab_Tested-blue?style=for-the-badge&logo=cisco)](.)
[![Security](https://img.shields.io/badge/Security-Essential-red?style=for-the-badge)](.)
[![Status](https://img.shields.io/badge/Status-Complete-success?style=for-the-badge)](.)

[üìñ Overview](#-overview) ‚Ä¢ [üîê Port Security](#-port-security) ‚Ä¢ [üö´ Unused Ports](#-securing-unused-ports) ‚Ä¢ [üîß Lab Implementation](#-lab-implementation)

</div>

---

## üìñ Overview

**Port Security** restricts which devices can connect to switch ports based on MAC addresses, while **Unused Port Security** prevents unauthorized access through inactive ports.

### What You'll Learn:

| Feature | Purpose | Protection Method | Use Case |
|---------|---------|-------------------|----------|
| **Port Security** | Control device access | MAC address filtering | Active ports |
| **Sticky MAC** | Auto-learn MACs | Dynamic + persistent | End user ports |
| **Manual MAC** | Specific device only | Static configuration | Critical devices |
| **Unused Ports** | Block inactive ports | VLAN isolation + shutdown | Empty ports |

### Key Security Benefits:

‚úÖ **Prevent Unauthorized Access** - Only allowed devices can connect  
‚úÖ **Stop MAC Flooding** - Protect against switch table overflow  
‚úÖ **Prevent Device Theft** - Stolen device cannot reconnect  
‚úÖ **Secure Unused Ports** - No entry point for attackers  
‚úÖ **Violation Detection** - Alert on security breaches  

---

## üìö Table of Contents

- [üîê Port Security](#-port-security)
  - [What is Port Security](#what-is-port-security)
  - [Why Needed](#why-is-port-security-needed)
  - [Components](#port-security-components)
  - [Violation Modes](#violation-modes)
  - [MAC Address Types](#mac-address-types)
  - [Configuration](#port-security-configuration)
  - [Lab Implementation](#lab-implementation---port-security)
- [üö´ Securing Unused Ports](#-securing-unused-ports)
  - [The Problem](#the-problem)
  - [Solution](#solution---vlan-999-isolation)
  - [Configuration](#unused-ports-configuration)
  - [Lab Implementation](#lab-implementation---unused-ports)
- [üìù Quick Reference](#-quick-reference)

---

## üîê Port Security

### What is Port Security?

**Port Security** allows only authorized devices to connect to a switch port based on MAC addresses.

### Real-Life Analogy - Office Door Lock:

```
Think of port security like an office door with badge access:

Regular Door (No Security):
‚îî‚îÄ Anyone can enter ‚ùå

Badge-Protected Door (Port Security):
‚îî‚îÄ Only employees with valid badge can enter ‚úì

MAC Address = Employee Badge
Port = Door
Authorized MAC = Valid Badge
```

---

### Why is Port Security Needed?

**1. Prevent Unauthorized Access**
```
Problem: Employee brings personal laptop and plugs into network
Without Port Security: Laptop gets access ‚ùå
With Port Security: Port blocks unauthorized device ‚úì
```

**2. Prevent MAC Flooding Attack**
```
Attack: Attacker floods switch with fake MAC addresses
Result: Switch table full, becomes a hub (broadcasts everything)

Port Security: Limits MAC addresses per port ‚úì
```

**3. Prevent Device Theft**
```
Scenario: Laptop stolen from desk
Without Port Security: Thief plugs in stolen laptop elsewhere ‚ùå
With Port Security: Laptop cannot reconnect (wrong port) ‚úì
```

---

### Port Security Components

Port Security defines **3 key elements:**

#### 1. Maximum MAC Addresses

**How many devices can connect to this port?**

```
Example:
Maximum 1 = Only one device allowed
Maximum 2 = Two devices can connect (useful for IP phones)
Maximum 3 = Three devices allowed
```

**Configuration:**
```cisco
switchport port-security maximum 2
```

---

#### 2. Secure MAC Addresses

**Which MAC addresses are allowed?**

Three types available (explained in next section):
- Static (Manual)
- Dynamic (Auto-learn, temporary)
- Sticky (Auto-learn, permanent)

---

#### 3. Violation Action

**What happens if unauthorized device connects?**

Three modes available (explained in Violation Modes section):
- Shutdown (Default - most secure)
- Restrict (Drop packets + alert)
- Protect (Drop packets silently)

---

## Violation Modes

### Understanding the Three Modes:

<div align="center">

| Mode | Port State | Packets | Alert/Log | SNMP Trap | Counter | Severity |
|------|-----------|---------|-----------|-----------|---------|----------|
| **Shutdown** | Err-disabled | Dropped | Yes | Yes | Yes | Highest ‚ö†Ô∏è |
| **Restrict** | Up | Dropped | Yes | Yes | Yes | Medium ‚ö†Ô∏è |
| **Protect** | Up | Dropped | No | No | No | Low ‚ö†Ô∏è |

</div>

---

### 1. Shutdown Mode (Default - Most Secure)

**What happens:**
```
Unauthorized MAC connects
     ‚Üì
Port immediately shuts down (err-disabled)
     ‚Üì
Port LED turns amber/orange
     ‚Üì
SNMP trap sent
     ‚Üì
Syslog message logged
     ‚Üì
Administrator must manually recover port
```

**Recovery:**
```cisco
! Manual recovery
Switch(config)# interface fastEthernet 0/5
Switch(config-if)# shutdown
Switch(config-if)# no shutdown
Switch(config-if)# exit
```

**When to use:**
```
‚úì Critical ports (server connections)
‚úì High-security environments
‚úì Where unauthorized access must be prevented
‚úì When immediate alert needed
```

---

### 2. Restrict Mode

**What happens:**
```
Unauthorized MAC connects
     ‚Üì
Port stays UP
     ‚Üì
Unauthorized packets DROPPED
     ‚Üì
Authorized device continues working
     ‚Üì
SNMP trap + Syslog message sent
     ‚Üì
Violation counter increases
```

**When to use:**
```
‚úì Shared ports (IP phone + PC)
‚úì Where port shutdown is too disruptive
‚úì Need to monitor violations without downtime
‚úì Business-critical ports
```

---

### 3. Protect Mode

**What happens:**
```
Unauthorized MAC connects
     ‚Üì
Port stays UP
     ‚Üì
Unauthorized packets DROPPED (silently)
     ‚Üì
NO alerts, NO logs, NO SNMP
     ‚Üì
Authorized device continues working
     ‚Üì
Attacker doesn't know they're blocked
```

**When to use:**
```
‚úì Don't want to alert attacker
‚úì Silent security monitoring
‚úì High-traffic environments (avoid log spam)
‚úì Least disruptive option
```

---

### Comparison Example:

**Scenario: 3 PCs try to connect to a port with maximum 1 MAC allowed**

```
Shutdown Mode:
PC1 connects ‚Üí Allowed ‚úì
PC2 connects ‚Üí Port shuts down ‚ùå (err-disabled)
Result: Nobody can use port until admin fixes it

Restrict Mode:
PC1 connects ‚Üí Allowed ‚úì
PC2 connects ‚Üí PC2 blocked, PC1 still works ‚úì
Result: Alert sent, but PC1 continues working

Protect Mode:
PC1 connects ‚Üí Allowed ‚úì
PC2 connects ‚Üí PC2 blocked silently, PC1 works ‚úì
Result: No alert, attacker doesn't know
```

---

## MAC Address Types

### 1. Static MAC (Manual Configuration)

**What it is:**
```
Administrator manually configures specific MAC address
MAC is saved in running-config
Survives reboot (if saved)
```

**Configuration:**
```cisco
Switch(config-if)# switchport port-security mac-address aaaa.bbbb.cccc
```

**When to use:**
```
‚úì Critical servers
‚úì Specific workstations
‚úì Network printers
‚úì When you know exact device MAC
```

**Example:**
```
CEO's computer:
MAC: 0011.2233.4455
Port: Fa0/10

Configuration:
interface fastEthernet 0/10
 switchport port-security mac-address 0011.2233.4455
 
Only CEO's computer can connect to Fa0/10 ‚úì
```

---

### 2. Dynamic MAC (Auto-learn, Temporary)

**What it is:**
```
Switch automatically learns first connected device's MAC
MAC stored in memory (NOT in running-config)
Lost after reboot ‚ùå
```

**Configuration:**
```cisco
! Just enable port security (default behavior)
Switch(config-if)# switchport port-security
```

**When to use:**
```
‚úì Testing environments
‚úì Temporary setups
‚úì When device MAC changes frequently
‚úó NOT for production (lost on reboot)
```

**Behavior:**
```
Port Fa0/5 (no MAC configured):
First device (MAC: AA:BB:CC) connects
     ‚Üì
Switch learns: AA:BB:CC is allowed
     ‚Üì
Second device (MAC: 11:22:33) tries
     ‚Üì
Violation! Only AA:BB:CC allowed
     ‚Üì
Switch reboots
     ‚Üì
All dynamic MACs forgotten ‚ùå
```

---

### 3. Sticky MAC (Auto-learn, Permanent) ‚≠ê **BEST OPTION**

**What it is:**
```
Switch automatically learns MAC (like dynamic)
BUT saves it to running-config (like static)
Survives reboot ‚úì
```

**Configuration:**
```cisco
Switch(config-if)# switchport port-security mac-address sticky
```

**Why Sticky is Best:**
```
‚úì No manual MAC entry needed (automatic)
‚úì Saved in config (survives reboot)
‚úì Best of both worlds!
‚úì Recommended for production
```

**Behavior:**
```
Port Fa0/5 with sticky MAC:
First device (MAC: AA:BB:CC) connects
     ‚Üì
Switch learns: AA:BB:CC
     ‚Üì
Automatically adds to running-config:
"switchport port-security mac-address sticky AA:BB:CC"
     ‚Üì
Switch reboots
     ‚Üì
MAC still remembered ‚úì
```

---

### Comparison Table:

<div align="center">

| Feature | Static | Dynamic | Sticky |
|---------|--------|---------|--------|
| **Configuration** | Manual | Automatic | Automatic |
| **Saved in config** | Yes | No | Yes |
| **Survives reboot** | Yes | No | Yes |
| **Flexibility** | Low | High | Medium |
| **Production use** | Yes | No | **Yes ‚≠ê** |
| **Best for** | Known devices | Testing | General use |

</div>

---

## Port Security Configuration

### Basic Port Security Setup

```cisco
! Step 1: Enter interface
Switch(config)# interface fastEthernet 0/5

! Step 2: Set port to access mode
Switch(config-if)# switchport mode access

! Step 3: Enable port security
Switch(config-if)# switchport port-security

! Step 4: Set maximum MAC addresses (default = 1)
Switch(config-if)# switchport port-security maximum 2

! Step 5: Set violation mode (default = shutdown)
Switch(config-if)# switchport port-security violation shutdown

! Step 6: Exit
Switch(config-if)# exit
```

---

### Sticky MAC Configuration (Recommended)

```cisco
Switch(config)# interface fastEthernet 0/5
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# exit
```

**What happens:**
```
First device connects
     ‚Üì
MAC automatically learned and saved
     ‚Üì
running-config shows:
"switchport port-security mac-address sticky AA:BB:CC:DD:EE:FF"
```

---

### Static MAC Configuration

```cisco
Switch(config)# interface fastEthernet 0/5
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address 0011.2233.4455
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation restrict
Switch(config-if)# exit
```

---

### Multiple Ports Configuration

```cisco
! Apply to multiple ports at once
Switch(config)# interface range fastEthernet 0/5-24
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport port-security
Switch(config-if-range)# switchport port-security maximum 1
Switch(config-if-range)# switchport port-security violation restrict
Switch(config-if-range)# switchport port-security mac-address sticky
Switch(config-if-range)# exit
```

---

## Lab Implementation - Port Security

### Network Topology

<p align="center">
  <img src="images/port-security-topology.png" alt="Port Security Lab Topology" width="700">
</p>

**Network Setup:**
```
Switch with 6 configured ports:
‚îú‚îÄ Fa0/1-2: Dynamic MAC (auto-learn)
‚îú‚îÄ Fa0/3-4: Sticky MAC (recommended)
‚îú‚îÄ Fa0/5-6: Static MAC (manual)
‚îî‚îÄ Multiple PCs for testing
```

---

### Configuration - Ports Fa0/1-2 (Dynamic MAC)

<p align="center">
  <img src="images/port-security-fa01-02.png" alt="Configuration for Fa0/1-2" width="700">
</p>

**Dynamic MAC Configuration:**

```cisco
! Configure Fa0/1
Switch(config)# interface fastEthernet 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# exit

! Configure Fa0/2 (same as Fa0/1)
Switch(config)# interface fastEthernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation shutdown
Switch(config-if)# exit
```

**Behavior:**
```
First device connects ‚Üí MAC learned (temporary)
Reboot ‚Üí MAC forgotten ‚ùå
Use case: Testing or lab environment
```

---

### Configuration - Ports Fa0/3-4 (Sticky MAC)

<p align="center">
  <img src="images/port-security-fa03-04.png" alt="Configuration for Fa0/3-4" width="700">
</p>

**Sticky MAC Configuration:**

```cisco
! Configure Fa0/3
Switch(config)# interface fastEthernet 0/3
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation restrict
Switch(config-if)# exit

! Configure Fa0/4 (same as Fa0/3)
Switch(config)# interface fastEthernet 0/4
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation restrict
Switch(config-if)# exit
```

**Behavior:**
```
Device connects ‚Üí MAC learned automatically
MAC saved to running-config ‚úì
Reboot ‚Üí MAC still present ‚úì
Use case: Production environment (recommended!)
```

---

### Check PC MAC Address for Manual Setup

<p align="center">
  <img src="images/check-pc10-mac.png" alt="Check PC10 MAC Address" width="700">
</p>

**Find MAC Address on PC:**

```
Method 1: Using PC GUI
1. Click on PC10
2. Go to Desktop
3. Click "Command Prompt"
4. Type: ipconfig /all
5. Note the "Physical Address" (MAC address)

Example Output:
Physical Address: 0060.5C12.3456
```

**Why check MAC?**
```
For static MAC configuration on Fa0/5-6
We need exact MAC address of PC10
```

---

### Configuration - Ports Fa0/5-6 (Static MAC)

<p align="center">
  <img src="images/port-security-fa05-06.png" alt="Configuration for Fa0/5-6" width="700">
</p>

**Static MAC Configuration:**

```cisco
! Configure Fa0/5 (using PC10's MAC)
Switch(config)# interface fastEthernet 0/5
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address 0060.5C12.3456
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation protect
Switch(config-if)# exit

! Configure Fa0/6 (using another PC's MAC)
Switch(config)# interface fastEthernet 0/6
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security mac-address 0060.7A45.6789
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security violation protect
Switch(config-if)# exit
```

**Behavior:**
```
Only PC10 (MAC: 0060.5C12.3456) can use Fa0/5 ‚úì
Any other device ‚Üí Violation (protect mode = silent drop)
Use case: Critical devices, servers, specific workstations
```

---

### Verification - Port Security Status

<p align="center">
  <img src="images/port-security-verification.png" alt="Port Security Verification" width="700">
</p>

**Verification Commands:**

```cisco
! Check port security status on all ports
Switch# show port-security

! Check specific interface
Switch# show port-security interface fastEthernet 0/5

! View all secure MAC addresses
Switch# show port-security address
```

---

### Verification Output - Port Security Status

<p align="center">
  <img src="images/port-security-status.png" alt="Port Security Status Display" width="700">
</p>

**Expected Output:**
```
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown/Restrict/Protect
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 0 (dynamic) or 1 (static/sticky)
Sticky MAC Addresses       : 1 (if sticky configured)
Security Violation Count   : 0
```

**Status Meanings:**

```
Secure-up
‚îî‚îÄ Port is up and secure ‚úì

Secure-down
‚îî‚îÄ Port is down (cable disconnected)

Secure-shutdown (err-disabled)
‚îî‚îÄ Port shut down due to violation ‚ùå
```

---

### Testing - Imposter Connection

**Scenario: Unauthorized device tries to connect**

```
Port Fa0/5 configured:
‚îú‚îÄ Static MAC: 0060.5C12.3456 (PC10 only)
‚îú‚îÄ Maximum: 1
‚îî‚îÄ Violation: Protect

Imposter PC (MAC: 1234.5678.9ABC) connects to Fa0/5:
     ‚Üì
Switch checks: Is MAC 1234.5678.9ABC allowed?
     ‚Üì
NO! Only 0060.5C12.3456 is authorized
     ‚Üì
Violation mode = Protect
     ‚Üì
Imposter packets silently dropped ‚úó
     ‚Üì
No network access for imposter
     ‚Üì
No alert (protect mode is silent)
```

**Result:** ‚úÖ Imposter cannot send packets, network protected!

---

## üö´ Securing Unused Ports

### The Problem

<p align="center">
  <img src="images/unused-ports-problem-topology.png" alt="Problem - Many Ports Unused" width="700">
</p>

**Security Risk:**

```
Network Status:
‚îú‚îÄ 24 total switch ports
‚îú‚îÄ Only 6 ports in use (Fa0/1-6)
‚îî‚îÄ 18 ports unused (Fa0/7-24)

Problem:
Unused port = Entry point for attacker! üö®

Attack Scenario:
1. Attacker enters building
2. Finds unused network port (Fa0/15)
3. Plugs in laptop
4. Gets network access ‚ùå
5. Can attack internal systems
```

---

### Current Switch Status

<p align="center">
  <img src="images/unused-ports-switch-info.png" alt="Switch Info Before Protection" width="700">
</p>

**Switch Information:**
```
Show VLAN Brief:

VLAN 1 (default):
‚îú‚îÄ Fa0/1 - Active
‚îú‚îÄ Fa0/2 - Active
‚îú‚îÄ Fa0/3 - Active
‚îú‚îÄ ...
‚îú‚îÄ Fa0/7 - Down (unused) ‚ö†Ô∏è
‚îú‚îÄ Fa0/8 - Down (unused) ‚ö†Ô∏è
‚îú‚îÄ ...
‚îî‚îÄ Fa0/24 - Down (unused) ‚ö†Ô∏è

All ports in VLAN 1 = Security risk!
```

---

### Solution - VLAN 999 Isolation

**Best Practice: Move unused ports to isolated VLAN**

#### Why VLAN 999?

```
VLAN 999 = "Parking VLAN" or "Blackhole VLAN"

Benefits:
‚úì Isolated from production VLANs
‚úì No routing to other VLANs
‚úì Not allowed on trunk ports
‚úì Industry standard practice
‚úì Easy to identify unused ports
```

---

### Unused Ports Configuration

<p align="center">
  <img src="images/vlan-999-creation.png" alt="Creating VLAN 999 and Assigning Ports" width="700">
</p>

**Step-by-Step Configuration:**

```cisco
! Step 1: Create VLAN 999 (parking VLAN)
Switch(config)# vlan 999
Switch(config-vlan)# name UNUSED-PORTS
Switch(config-vlan)# exit

! Step 2: Assign unused ports to VLAN 999
Switch(config)# interface range fastEthernet 0/7-24
Switch(config-if-range)# description Unused Ports - Secured
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 999
Switch(config-if-range)# shutdown
Switch(config-if-range)# exit

! Step 3: Save configuration
Switch(config)# exit
Switch# write memory
```

**What each command does:**

```
vlan 999
‚îî‚îÄ Create parking VLAN

switchport access vlan 999
‚îî‚îÄ Move ports to isolated VLAN

shutdown
‚îî‚îÄ Administratively disable ports (double protection!)
```

---

### Trunk Configuration - Block VLAN 999

<p align="center">
  <img src="images/trunk-allow-vlans.png" alt="Trunk Configuration Blocking VLAN 999" width="700">
</p>

**Configure Trunk Ports:**

```cisco
! Configure trunk to NOT allow VLAN 999
Switch(config)# interface gigabitEthernet 0/1
Switch(config-if)# description Trunk to Core Switch
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk allowed vlan 10,20,30
Switch(config-if)# exit
```

**Why exclude VLAN 999?**

```
Production VLANs: 10, 20, 30 (allowed on trunk)
VLAN 999: Unused ports (NOT allowed)

Result:
Even if attacker activates port in VLAN 999,
traffic won't pass through trunk! ‚úì
```

---

### Verification - Switch Info After Protection

<p align="center">
  <img src="images/unused-ports-verification.png" alt="Switch Info After Securing Ports" width="700">
</p>

**Verification Commands:**

```cisco
! Check VLAN assignment
Switch# show vlan brief

! Check interface status
Switch# show interface status

! Verify trunk allowed VLANs
Switch# show interfaces trunk
```

**Expected Output:**

```
VLAN 10:
‚îú‚îÄ Fa0/1 - Active
‚îî‚îÄ Fa0/2 - Active

VLAN 20:
‚îú‚îÄ Fa0/3 - Active
‚îî‚îÄ Fa0/4 - Active

VLAN 30:
‚îú‚îÄ Fa0/5 - Active
‚îî‚îÄ Fa0/6 - Active

VLAN 999 (UNUSED-PORTS):
‚îú‚îÄ Fa0/7 - Down (disabled) ‚úì
‚îú‚îÄ Fa0/8 - Down (disabled) ‚úì
‚îú‚îÄ ...
‚îî‚îÄ Fa0/24 - Down (disabled) ‚úì

Trunk Gig0/1:
Allowed VLANs: 10, 20, 30 (NOT 999) ‚úì
```

---

## Lab Implementation - Unused Ports

### Final Protected Topology

<p align="center">
  <img src="images/unused-ports-final-topology.png" alt="Final Topology - Secured Network" width="700">
</p>

**Secured Network:**

```
Production Ports (Active):
‚îú‚îÄ Fa0/1-2 (VLAN 10) - Port Security Enabled ‚úì
‚îú‚îÄ Fa0/3-4 (VLAN 20) - Port Security Enabled ‚úì
‚îî‚îÄ Fa0/5-6 (VLAN 30) - Port Security Enabled ‚úì

Unused Ports (Secured):
‚îú‚îÄ Fa0/7-24 (VLAN 999) - Shutdown ‚úì
‚îî‚îÄ Not allowed on trunk ‚úì

Trunk Port:
‚îî‚îÄ Gig0/1: Allows VLAN 10,20,30 only (excludes 999) ‚úì

Security Layers:
1. Port Security on active ports ‚úì
2. Unused ports in VLAN 999 ‚úì
3. Unused ports shutdown ‚úì
4. VLAN 999 blocked on trunk ‚úì

Result: Complete protection! üõ°Ô∏è
```

---

### Attack Scenario - Prevented!

**Before Protection:**
```
Attacker finds Fa0/15 (unused)
     ‚Üì
Plugs in laptop
     ‚Üì
Gets IP from DHCP (VLAN 1)
     ‚Üì
Network access granted ‚ùå
```

**After Protection:**
```
Attacker finds Fa0/15 (now secured)
     ‚Üì
Port is shutdown (no link light)
     ‚Üì
Attacker manually enables port (from PC - impossible!)
     ‚Üì
Even if enabled somehow:
  - Port in VLAN 999
  - Isolated from production
  - Not allowed on trunk
     ‚Üì
No network access ‚úì
```

---

## üìù Quick Reference

### Port Security Commands

**Basic Setup:**
```cisco
interface fastEthernet 0/5
 switchport mode access
 switchport port-security
 switchport port-security maximum 1
 switchport port-security violation shutdown
```

**Sticky MAC (Recommended):**
```cisco
interface fastEthernet 0/5
 switchport port-security mac-address sticky
```

**Static MAC:**
```cisco
interface fastEthernet 0/5
 switchport port-security mac-address 0011.2233.4455
```

**Multiple Ports:**
```cisco
interface range fastEthernet 0/5-24
 switchport mode access
 switchport port-security
 switchport port-security mac-address sticky
 switchport port-security maximum 1
 switchport port-security violation restrict
```

---

### Unused Ports Commands

**Secure Unused Ports:**
```cisco
! Create VLAN 999
vlan 999
 name UNUSED-PORTS

! Assign and shutdown unused ports
interface range fastEthernet 0/7-24
 description Unused - Secured
 switchport mode access
 switchport access vlan 999
 shutdown
```

**Trunk Configuration:**
```cisco
interface gigabitEthernet 0/1
 switchport mode trunk
 switchport trunk allowed vlan 10,20,30
```

---

### Verification Commands

**Port Security:**
```cisco
show port-security
show port-security interface fastEthernet 0/5
show port-security address
show port-security interface fastEthernet 0/5 | include Violation
```

**VLAN Status:**
```cisco
show vlan brief
show interface status
show interfaces trunk
```

**Recover Err-Disabled Port:**
```cisco
interface fastEthernet 0/5
 shutdown
 no shutdown
```

**Auto-Recovery:**
```cisco
errdisable recovery cause psecure-violation
errdisable recovery interval 300
```

---

### Configuration Templates

**Complete Port Security Template:**

```cisco
! ========================================
! Port Security Configuration Template
! ========================================

! Production ports (Sticky MAC - Recommended)
interface range fastEthernet 0/1-6
 description User Access Ports
 switchport mode access
 switchport port-security
 switchport port-security maximum 1
 switchport port-security mac-address sticky
 switchport port-security violation restrict
 exit

! Critical devices (Static MAC)
interface fastEthernet 0/10
 description CEO Workstation
 switchport mode access
 switchport port-security
 switchport port-security mac-address 0011.2233.4455
 switchport port-security violation shutdown
 exit

! Unused ports (VLAN 999)
vlan 999
 name UNUSED-PORTS
 exit

interface range fastEthernet 0/7-24
 description Unused Ports - Secured
 switchport mode access
 switchport access vlan 999
 shutdown
 exit

! Trunk configuration
interface gigabitEthernet 0/1
 description Trunk to Core
 switchport mode trunk
 switchport trunk allowed vlan 10,20,30
 exit

! Save
write memory
```

---

### Best Practices Summary

<div align="center">

| Practice | Purpose | Command |
|----------|---------|---------|
| **Use Sticky MAC** | Auto-learn + save | `mac-address sticky` |
| **Restrict Mode** | Business continuity | `violation restrict` |
| **VLAN 999** | Isolate unused ports | `switchport access vlan 999` |
| **Shutdown Unused** | Double protection | `shutdown` |
| **Block VLAN 999 on Trunk** | Prevent propagation | `trunk allowed vlan 10,20,30` |
| **Auto-Recovery** | Reduce admin overhead | `errdisable recovery` |

</div>

---

### Security Checklist

**Port Security:**
```
‚úì Enable on all access ports
‚úì Use sticky MAC (recommended)
‚úì Set appropriate maximum (usually 1)
‚úì Choose violation mode based on needs
‚úì Test with unauthorized device
‚úì Verify port-security status
‚úì Configure auto-recovery (optional)
```

**Unused Ports:**
```
‚úì Create VLAN 999 (parking VLAN)
‚úì Move all unused ports to VLAN 999
‚úì Shutdown all unused ports
‚úì Exclude VLAN 999 from trunks
‚úì Regularly audit port status
‚úì Document which ports are secured
```

---

---

## üéì What I Learned

### Port Security:
‚úÖ **MAC address filtering** - Allow only authorized devices  
‚úÖ **Three violation modes** - Shutdown, Restrict, Protect  
‚úÖ **MAC address types** - Static, Dynamic, Sticky  
‚úÖ **Sticky MAC benefits** - Auto-learn + persistent  
‚úÖ **Attack prevention** - MAC flooding, unauthorized access  
‚úÖ **Error recovery** - Manual and automatic methods  

### Unused Ports Security:
‚úÖ **VLAN 999 isolation** - Parking VLAN concept  
‚úÖ **Double protection** - VLAN assignment + shutdown  
‚úÖ **Trunk security** - Blocking unused VLANs  
‚úÖ **Attack surface reduction** - Minimize entry points  
‚úÖ **Industry best practices** - Standard security approach  

### Security Principles:
‚úÖ **Defense in depth** - Multiple security layers  
‚úÖ **Least privilege** - Minimal necessary access  
‚úÖ **Fail-secure** - Default deny approach  
‚úÖ **Audit and monitor** - Regular security checks  

---

## üöÄ How to Use This Repository

1. **Clone the repository:**
   ```bash
   git clone https://github.com/abdul-wahid022/Port-Security.git
   ```

2. **Understand concepts:**
   - Learn port security components
   - Study violation modes
   - Review MAC address types
   - Understand unused ports risk

3. **Practice configurations:**
   - Set up port security with sticky MAC
   - Test violation modes
   - Configure VLAN 999
   - Test unauthorized access attempts

4. **Deploy in production:**
   - Apply to all access ports
   - Secure all unused ports
   - Configure trunks properly
   - Regular security audits

---

## üìû Connect With Me

<div align="center">

[![Email](https://img.shields.io/badge/Email-a.wahid7860668%40gmail.com-red?style=for-the-badge&logo=gmail)](mailto:a.wahid7860668@gmail.com)
[![LinkedIn](https://img.shields.io/badge/LinkedIn-Abdul_Wahid-blue?style=for-the-badge&logo=linkedin)](https://www.linkedin.com/in/abdul-wahid022)
[![GitHub](https://img.shields.io/badge/GitHub-abdul--wahid022-black?style=for-the-badge&logo=github)](https://github.com/abdul-wahid022)

**üí¨ Questions? Need Packet Tracer files? Feel free to reach out!**

</div>

---

## üìÑ License

This project is created for **educational purposes** and is open-source.

---

<div align="center">

### ‚≠ê If you found this helpful, please give it a star!

**Made with ‚ù§Ô∏è by ABDUL WAHID**

*Last Updated: January 2026*

</div>
